PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_rram.h
/***************************************************************************//**
* \file cy_rram.h
* \version 1.10
*
* \brief
* Provides an API declaration of the RRAM driver.
*
********************************************************************************
* \copyright
* Copyright (c) 2022-2025, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \defgroup group_rram               RRAM         (Resistive Random Access Memory)
* \{
*
* Resistive Random Access Memory (RRAM) is a type of non-volatile memory which is going
* to replace FLASH and OTP memory in MXS22 platform. RRAM is configured as NVM(512KB) + Extra(16KB) region.
* NVM memory region is further divided into MAIN (code), Em_EEPROM, SupMEM (Supervisory), and PROTECTED sub regions.
* The 16KB is RRAM extra area and is partitioned into lower 14KB as OTP region and the highest
* 2KB as configuration space region.
* OTP region is further divided into PROTECTED_OTP (including BootRow and UDS), General OTP data and
* BISR SRAM repair OTP regions.
*
* RRAM driver provides API's to Read/Write from/to RRAM memory,
* Enable/Disable RRAM sleep mode, Write protection.
* The functions and other declarations used in this driver are in cy_rram.h
* You can include cy_pdl.h to get access to all functions
* and declarations in the PDL.h
*
* \section group_rram_configuration Configuration Considerations
*
* The RRAM driver provides the API to read and write to RRAM memory.
* No configuration is needed.
*
* \section group_rram_more_information More Information
*
* Refer to the technical reference manual (TRM) and the device datasheet.

* \section group_rram_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.10</td>
*     <td>Fixed hard fault when trying read while TS writing</td>
*     <td></td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_rram_macros Macros
* \defgroup group_rram_enums Enums
* \defgroup group_rram_functions Functions
*
* \note In order to acquire PC_LOCK from CM33 the bootrow(0x50100000) value should be updated with
*  0xdb, 0x00, 0x00, 0x00, 0x70, 0x0b, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
*  where 0xdb should be written at 0th offset. Bootrow can be updated using \ref Cy_RRAM_OtpReadByteArray() API.
*/

#if !defined(CY_RRAM_H)
#define CY_RRAM_H

#include "cy_device.h"

#if defined (CY_IP_MXS22RRAMC)

#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 6, \
                             'Value extracted from _VAL2FLD macro will not exceed enum range.')

/*******************************************************************************
*       Function Constants
*******************************************************************************/

/**
* \addtogroup group_rram_macros
* \{
*/

/** Driver major version */
#define CY_RRAM_DRV_VERSION_MAJOR    1

/** Driver minor version */
#define CY_RRAM_DRV_VERSION_MINOR    0

/** Driver ID */
#define CY_RRAM_ID CY_PDL_DRV_ID     (0x4DU)

/** \cond INTERNAL */

/* The base address and size related macros will be generated during header generation process.*/
#ifdef CY_DEVICE_IFX_SECURITY_EPC2
#define CY_RRAM_MAIN_N                          (0x35UL)
#else
#define CY_RRAM_MAIN_N                          (0x20UL)
#endif /* CY_DEVICE_IFX_SECURITY_EPC2 */
#define CY_RRAM_WORK_Z                          (0x0UL)
#define CY_RRAM_FLASH_Y                         (0x0UL)
#define CY_RRAM_PROTECTED_X                     (0x20UL)
#define CY_RRAM_PC_LOCK_ACQUIRE                 (0x0FUL)
#define CY_RRAM_BLOCK_SIZE_BYTES                (0x10UL)
#define CY_RRAM_BLOCK_SIZE_WORDS                (0x04UL)
#define CY_RRAM_S_OFFSET_MASK                   (0x10000000UL)
#define CY_RRAM_REGION_SIZE_UNIT                (8192UL)
#define CY_RRAM_MAIN_REGION_SIZE                (CY_RRAM_MAIN_N * CY_RRAM_REGION_SIZE_UNIT)
#define CY_RRAM_WORK_REGION_SIZE                (CY_RRAM_WORK_Z * CY_RRAM_REGION_SIZE_UNIT)
#define CY_RRAM_SFLASH_REGION_SIZE              (CY_RRAM_FLASH_Y * CY_RRAM_REGION_SIZE_UNIT)
#define CY_RRAM_PROTECTED_REGION_SIZE           (CY_RRAM_PROTECTED_X * CY_RRAM_REGION_SIZE_UNIT)
#define CY_RRAM_PROTECTED_OTP_SIZE              (0x00002000UL)
#define CY_RRAM_GENERAL_OTP_SIZE                (0x00001600UL)
#define CY_RRAM_INVALID_ACCESS                  (0x0UL)
#define CY_RRAM_NVM_SIZE_KB                     (0x00000200UL)
#define CY_RRAM_SECTOR_SIZE_KB                  (0X04UL)
#define CY_RRAM_PROTECTED_LOCK_REGION_LIMIT     (0x00000100UL)

/* Base address of NVM region */
#if (CY_CPU_CORTEX_M0P)
#define CY_RRAM_MAIN_HOST_NS_START_ADDRESS            (0x02000000UL)
#define CY_RRAM_MAIN_HOST_S_START_ADDRESS             (0x12000000UL)
#define CY_RRAM_WORK_HOST_NS_START_ADDRESS            (0x03000000UL)
#define CY_RRAM_WORK_HOST_S_START_ADDRESS             (0x13000000UL)
#define CY_RRAM_SFLASH_HOST_NS_START_ADDRESS          (0x03600000UL)
#define CY_RRAM_SFLASH_HOST_S_START_ADDRESS           (0x13600000UL)
#define CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS       (0x03C00000UL)
#define CY_RRAM_PROTECTED_HOST_S_START_ADDRESS        (0x13C00000UL)
#define CY_RRAM_PROTECTED_PROTECTED_NS_START_ADDRESS  (0x03800000UL)
#define CY_RRAM_PROTECTED_PROTECTED_S_START_ADDRESS   (0x13800000UL)
/* Remove once CDT_005546-83 is fixed */
#define CY_RRAM_CONFIG_SPACE_SIZE                      (0x2048UL)
#define CY_RRAM_CONFIG_PROTECTED_NS_START_ADDRESS      (0x40108800UL)
#define CY_RRAM_CONFIG_PROTECTED_S_START_ADDRESS       (0x50108800UL)
#define CY_RRAM_CONFIG_PROTECTED_NS_END_ADDRESS        (CY_RRAM_CONFIG_PROTECTED_NS_START_ADDRESS + CY_RRAM_CONFIG_SPACE_SIZE - 1UL)
#define CY_RRAM_CONFIG_PROTECTED_S_END_ADDRESS         (CY_RRAM_CONFIG_PROTECTED_S_START_ADDRESS  + CY_RRAM_CONFIG_SPACE_SIZE - 1UL)
#define CY_RRAM_PHYSICAL_CONFIG_SPACE_BASE_ADDR        (0x00008380UL)
//
#elif (CY_CPU_CORTEX_M55)
#define CY_RRAM_MAIN_HOST_NS_START_ADDRESS            (0x02000000UL)
#define CY_RRAM_WORK_HOST_NS_START_ADDRESS            (0x03000000UL)
#define CY_RRAM_SFLASH_HOST_NS_START_ADDRESS          (0x03600000UL)
#define CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS       (0x03C00000UL)
#else
#define CY_RRAM_MAIN_HOST_NS_START_ADDRESS            (0x22000000UL)
#define CY_RRAM_MAIN_HOST_S_START_ADDRESS             (0x32000000UL)
#define CY_RRAM_MAIN_HOST_CBUS_NS_START_ADDRESS       (0x02000000UL)
#define CY_RRAM_MAIN_HOST_CBUS_S_START_ADDRESS        (0x12000000UL)
#define CY_RRAM_WORK_HOST_NS_START_ADDRESS            (0x03000000UL)
#define CY_RRAM_WORK_HOST_S_START_ADDRESS             (0x13000000UL)
#define CY_RRAM_SFLASH_HOST_NS_START_ADDRESS          (0x03600000UL)
#define CY_RRAM_SFLASH_HOST_S_START_ADDRESS           (0x13600000UL)
#define CY_RRAM_PROTECTED_HOST_CBUS_NS_START_ADDRESS  (0x03C00000UL)
#define CY_RRAM_PROTECTED_HOST_CBUS_S_START_ADDRESS   (0x13C00000UL)
#define CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS       (0x23C00000UL)
#define CY_RRAM_PROTECTED_HOST_S_START_ADDRESS        (0x33C00000UL)
#define CY_RRAM_PROTECTED_PROTECTED_NS_START_ADDRESS  (0x03800000UL)
#define CY_RRAM_PROTECTED_PROTECTED_S_START_ADDRESS   (0x13800000UL)
#endif

/* Base address for OTP region */
#define CY_RRAM_GENERAL_OTP_MMIO_NS_START_ADDRESS         (0x42204000UL)
#define CY_RRAM_GENERAL_OTP_MMIO_S_START_ADDRESS          (0x52204000UL)
#define CY_RRAM_PROTECTED_OTP_PROTECTED_NS_START_ADDRESS  (0x40100000UL)
#define CY_RRAM_PROTECTED_OTP_PROTECTED_S_START_ADDRESS   (0x50100000UL)

/* End address of NVM region */
#define CY_RRAM_MAIN_HOST_NS_END_ADDRESS               (CY_RRAM_MAIN_REGION_SIZE != 0UL ? (CY_RRAM_MAIN_HOST_NS_START_ADDRESS + CY_RRAM_MAIN_REGION_SIZE - 1UL) : CY_RRAM_MAIN_HOST_NS_START_ADDRESS)
#define CY_RRAM_MAIN_HOST_S_END_ADDRESS                (CY_RRAM_MAIN_REGION_SIZE != 0UL ? (CY_RRAM_MAIN_HOST_S_START_ADDRESS + CY_RRAM_MAIN_REGION_SIZE - 1UL) : CY_RRAM_MAIN_HOST_S_START_ADDRESS)
#define CY_RRAM_MAIN_HOST_CBUS_NS_END_ADDRESS          (CY_RRAM_MAIN_REGION_SIZE != 0UL ? (CY_RRAM_MAIN_HOST_CBUS_NS_START_ADDRESS + CY_RRAM_MAIN_REGION_SIZE - 1UL) : CY_RRAM_MAIN_HOST_CBUS_NS_START_ADDRESS)
#define CY_RRAM_MAIN_HOST_CBUS_S_END_ADDRESS           (CY_RRAM_MAIN_REGION_SIZE != 0UL ? (CY_RRAM_MAIN_HOST_CBUS_S_START_ADDRESS + CY_RRAM_MAIN_REGION_SIZE - 1UL) : CY_RRAM_MAIN_HOST_CBUS_S_START_ADDRESS)
#define CY_RRAM_WORK_HOST_NS_END_ADDRESS               (CY_RRAM_WORK_REGION_SIZE != 0UL ? (CY_RRAM_WORK_HOST_NS_START_ADDRESS + CY_RRAM_WORK_REGION_SIZE - 1UL) : CY_RRAM_WORK_HOST_NS_START_ADDRESS)
#define CY_RRAM_WORK_HOST_S_END_ADDRESS                (CY_RRAM_WORK_REGION_SIZE != 0UL ? (CY_RRAM_WORK_HOST_S_START_ADDRESS + CY_RRAM_WORK_REGION_SIZE - 1UL) : CY_RRAM_WORK_HOST_S_START_ADDRESS)
#define CY_RRAM_SFLASH_HOST_NS_END_ADDRESS             (CY_RRAM_SFLASH_REGION_SIZE != 0UL ? (CY_RRAM_SFLASH_HOST_NS_START_ADDRESS + CY_RRAM_SFLASH_REGION_SIZE - 1UL) : CY_RRAM_SFLASH_HOST_NS_START_ADDRESS)
#define CY_RRAM_SFLASH_HOST_S_END_ADDRESS              (CY_RRAM_SFLASH_REGION_SIZE != 0UL ? (CY_RRAM_SFLASH_HOST_S_START_ADDRESS + CY_RRAM_SFLASH_REGION_SIZE - 1UL) : CY_RRAM_SFLASH_HOST_NS_START_ADDRESS)
#define CY_RRAM_PROTECTED_HOST_NS_END_ADDRESS          (CY_RRAM_PROTECTED_REGION_SIZE != 0UL ? (CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS + CY_RRAM_PROTECTED_REGION_SIZE - 1UL) : CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS)
#define CY_RRAM_PROTECTED_HOST_S_END_ADDRESS           (CY_RRAM_PROTECTED_REGION_SIZE != 0UL ? (CY_RRAM_PROTECTED_HOST_S_START_ADDRESS + CY_RRAM_PROTECTED_REGION_SIZE - 1UL) : CY_RRAM_PROTECTED_HOST_S_START_ADDRESS)
#define CY_RRAM_PROTECTED_PROTECTED_NS_END_ADDRESS     (CY_RRAM_PROTECTED_REGION_SIZE != 0UL ? (CY_RRAM_PROTECTED_PROTECTED_NS_START_ADDRESS + CY_RRAM_PROTECTED_REGION_SIZE - 1UL) : CY_RRAM_PROTECTED_PROTECTED_NS_START_ADDRESS)
#define CY_RRAM_PROTECTED_PROTECTED_S_END_ADDRESS      (CY_RRAM_PROTECTED_REGION_SIZE != 0UL ? (CY_RRAM_PROTECTED_PROTECTED_S_START_ADDRESS + CY_RRAM_PROTECTED_REGION_SIZE - 1UL) : CY_RRAM_PROTECTED_PROTECTED_S_START_ADDRESS)
#define CY_RRAM_PROTECTED_HOST_CBUS_S_END_ADDRESS      (CY_RRAM_PROTECTED_REGION_SIZE != 0UL ? (CY_RRAM_PROTECTED_HOST_CBUS_S_START_ADDRESS + CY_RRAM_PROTECTED_REGION_SIZE - 1UL) : CY_RRAM_PROTECTED_HOST_CBUS_S_START_ADDRESS)
#define CY_RRAM_PROTECTED_HOST_CBUS_NS_END_ADDRESS     (CY_RRAM_PROTECTED_REGION_SIZE != 0UL ? (CY_RRAM_PROTECTED_HOST_CBUS_NS_START_ADDRESS + CY_RRAM_PROTECTED_REGION_SIZE - 1UL) : CY_RRAM_PROTECTED_HOST_CBUS_NS_START_ADDRESS)

/* End address for OTP region */
#define CY_RRAM_GENERAL_OTP_MMIO_NS_END_ADDRESS        (CY_RRAM_GENERAL_OTP_SIZE != 0UL ? (CY_RRAM_GENERAL_OTP_MMIO_NS_START_ADDRESS + CY_RRAM_GENERAL_OTP_SIZE - 1UL) :CY_RRAM_GENERAL_OTP_MMIO_NS_START_ADDRESS)
#define CY_RRAM_GENERAL_OTP_MMIO_S_END_ADDRESS         (CY_RRAM_GENERAL_OTP_SIZE != 0UL ? (CY_RRAM_GENERAL_OTP_MMIO_S_START_ADDRESS + CY_RRAM_GENERAL_OTP_SIZE - 1UL) : CY_RRAM_GENERAL_OTP_MMIO_S_START_ADDRESS)
#define CY_RRAM_PROTECTED_OTP_MMIO_NS_END_ADDRESS      (CY_RRAM_PROTECTED_OTP_SIZE != 0UL ? (CY_RRAM_PROTECTED_OTP_MMIO_NS_START_ADDRESS + CY_RRAM_PROTECTED_OTP_SIZE - 1UL) : CY_RRAM_PROTECTED_OTP_MMIO_NS_START_ADDRESS)
#define CY_RRAM_PROTECTED_OTP_MMIO_S_END_ADDRESS       (CY_RRAM_PROTECTED_OTP_SIZE != 0UL ? (CY_RRAM_PROTECTED_OTP_MMIO_S_START_ADDRESS + CY_RRAM_PROTECTED_OTP_SIZE - 1UL) : CY_RRAM_PROTECTED_OTP_MMIO_S_START_ADDRESS)
#define CY_RRAM_PROTECTED_OTP_PROTECTED_NS_END_ADDRESS (CY_RRAM_PROTECTED_OTP_SIZE != 0UL ? (CY_RRAM_PROTECTED_OTP_PROTECTED_NS_START_ADDRESS + CY_RRAM_PROTECTED_OTP_SIZE - 1UL) : CY_RRAM_PROTECTED_OTP_PROTECTED_NS_START_ADDRESS)
#define CY_RRAM_PROTECTED_OTP_PROTECTED_S_END_ADDRESS  (CY_RRAM_PROTECTED_OTP_SIZE != 0UL ? (CY_RRAM_PROTECTED_OTP_PROTECTED_S_START_ADDRESS + CY_RRAM_PROTECTED_OTP_SIZE - 1UL) : CY_RRAM_PROTECTED_OTP_PROTECTED_S_START_ADDRESS)

/* Physical address */
#define CY_RRAM_PHYSICAL_MAIN_BASE_ADDR                 (0x00000000UL)
#define CY_RRAM_PHYSICAL_WORK_BASE_ADDR                 (CY_RRAM_PHYSICAL_MAIN_BASE_ADDR + (CY_RRAM_MAIN_REGION_SIZE / CY_RRAM_BLOCK_SIZE_BYTES))               /* 0x00004000UL */
#define CY_RRAM_PHYSICAL_SFLASH_BASE_ADDR               (CY_RRAM_PHYSICAL_WORK_BASE_ADDR + (CY_RRAM_WORK_REGION_SIZE / CY_RRAM_BLOCK_SIZE_BYTES))               /* 0x00004000UL */
#define CY_RRAM_PHYSICAL_PROTECTED_BASE_ADDR            (CY_RRAM_PHYSICAL_SFLASH_BASE_ADDR + (CY_RRAM_SFLASH_REGION_SIZE / CY_RRAM_BLOCK_SIZE_BYTES))           /* 0x00004000UL */
#define CY_RRAM_PHYSICAL_PROTECTED_OTP_BASE_ADDR        (CY_RRAM_PHYSICAL_PROTECTED_BASE_ADDR + (CY_RRAM_PROTECTED_REGION_SIZE  / CY_RRAM_BLOCK_SIZE_BYTES))    /* 0x00008000UL */
#define CY_RRAM_PHYSICAL_GENERAL_OTP_BASE_ADDR          (CY_RRAM_PHYSICAL_PROTECTED_OTP_BASE_ADDR + (CY_RRAM_PROTECTED_OTP_SIZE / CY_RRAM_BLOCK_SIZE_BYTES))    /* 0x00008200UL */

