PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_rram.h
#define CY_RRAM_SECTOR_COUNT_VALID(numSectors)     ((numSectors) <= (CY_RRAM_NVM_SIZE_KB / CY_RRAM_SECTOR_SIZE_KB))

#define CY_RRAM_BLOCK_COUNT_VALID(numBlocks)      ((numBlocks > 0UL) && (numBlocks < ((CY_RRAM_NVM_SIZE_KB * 1024U) / CY_RRAM_BLOCK_SIZE_BYTES)))

/*
 * By default ECC Check is Enabled. This API is not meant for user. This API is used only during very early stage of
 * pre-silicon bring-up activity. During bring-up, RRAM test application can override this and disable ECC checking when tag
 * bits are being reset. Once the tag bits are reset, the test app can enable it so that ECC can be checked for normal
 * functionality of the driver.
 */

bool cy_rram_should_check_ecc(void);

/** \endcond */

/** \} group_rram_macros */

/**
* \addtogroup group_rram_enums
* \{
*/

/**
* RRAM driver error codes
*/
typedef enum
{
    CY_RRAM_SUCCESS                          = 0x0UL,                                     /**< Returned successful */
    CY_RRAM_BAD_PARAM                        = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x01UL, /**< Bad parameter was passed */
    CY_RRAM_ACQUIRE_PC_LOCK_FAIL             = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0X02UL, /**< Fail to acquire PC lock during indirect operation */
    CY_RRAM_OPERATION_TIME_OUT_ERROR         = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0X03UL, /**< Time out error during RRAM operation */
    CY_RRAM_WRITE_OPERATION_ERROR            = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x04UL, /**< Write operation failed */
    CY_RRAM_WPLOCK_ENABLED                   = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x05UL, /**< Write protection lock enabled */
    CY_RRAM_ECC_FAIL                         = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x06UL, /**< Read operation failed with uncorrectable ECC error */
    CY_RRAM_HARDEN_ALLMEM_FAIL               = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x07UL, /**< Hardening of complete memory failed */
    CY_RRAM_UPDATE_LOCKABLE_REGION_FAILED    = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x08UL, /**< The Lock bit state is Locked. Failed to update the lockable region. */
    CY_RRAM_VERR_BLOCK_FAIL_BITS             = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x09UL, /**< Information on number of fail bits for a block after verify operations in indirect
                                                                                               write, verify-only, and forming operations */
    CY_RRAM_ADDRESS_UPDATE_FAIL              = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x0AUL,   /**< Failed to write NVM_ADDR register for write operation */
    CY_RRAM_INIT_FAIL                        = CY_RRAM_ID | CY_PDL_STATUS_ERROR | 0x0BUL   /**< Failed to retrieve configuration from configuration space in extra area. */
} cy_en_rram_status_t;

/**
* RRAM protected lock for NVM region
*/
typedef enum
{
    CY_RRAM_PROTECTED_UNLOCK    = 0x00UL,      /**< Not locked, PARTITION_SIZE_0/1 in PROTECTED_NVM region */
    CY_RRAM_PROTECTED_LOCK      = 0x0FUL       /**< Locked, PARTITION_SIZE_0/1 in PROTECTED_NVM region */
} cy_en_rram_protected_lock_t;

/**
* RRAM UDS lock for NVM region
*/
typedef enum
{
    CY_RRAM_UDS_UNLOCK    = 0x00UL,      /**< Not locked, Access to UDS_KEY */
    CY_RRAM_UDS_LOCK      = 0x0FUL       /**< Locked, No access to UDS_KEY */
} cy_en_rram_uds_lock_t;

/**
* RRAM write protection lock for NVM region
*/
typedef enum
{
    CY_RRAM_WP_UNLOCK    = 0x00UL,      /**< Not locked, Sectors for write protection can be configured. */
    CY_RRAM_WP_LOCK      = 0x01UL       /**< Locked, Sectors for write protection cannot be configured. */
} cy_en_rram_wp_lock_t;


/**
* RRAM sleep mode status
*/
typedef enum
{
    CY_RRAM_NOT_IN_SLEEP    = 0x00UL,      /**< Not in sleep mode, and no sleep or wake up procedure in progress.*/
    CY_RRAM_IN_SLEEP        = 0x01UL       /**< In sleep mode, or busy due to a sleep or wake up procedure.*/
} cy_en_rram_sleep_t;

/**
* RRAM operations
*/
typedef enum
{
    CY_RRAM_IDLE                = 0x00UL,  /**< Idle state */
    CY_RRAM_INDIRECT_WRITE      = 0x01UL,  /**< Indirect write operation */
    CY_RRAM_VERIFY_ONLY         = 0x02UL,  /**< Verify only operation */
    CY_RRAM_HARDENING           = 0x04UL,  /**< Hardening operation */
    CY_RRAM_LOOPED_FORMING      = 0x07UL,  /**< Looped forming operation */
    CY_RRAM_FORMING             = 0x08UL,  /**< Forming operation */
    CY_RRAM_RETRIEVE_CONFIG     = 0x0BUL,  /**< Retrieve configuration */
    CY_RRAM_LOOPED_WRITE        = 0x0EUL   /**< Looped write*/
} cy_en_rram_operation_t;

/**
* RRAM error codes
*/
typedef enum
{
    CY_RRAM_NO_ERROR                     = 0x00UL,  /**< No Error */
    CY_RRAM_SINGLE_BIT_ERROR             = 0x01UL,  /**< Single Bit fail */
    CY_RRAM_DOUBLE_BIT_ERROR             = 0x02UL,  /**< Double Bit fail */
    CY_RRAM_TRIPLE_BIT_ERROR             = 0x03UL,  /**< Triple Bit fail */
    CY_RRAM_ECC_UNCORRECTABLE_BIT_ERROR  = 0x04UL,  /**< ECC uncorrectable fail bit error */
    CY_RRAM_ECC_ADDR_MISMATCH_ERROR      = 0x05UL,  /**< ECC address mismatch error */
    CY_RRAM_CONFIG_ERROR                 = 0x06UL,  /**< Config error */
    CY_RRAM_ALGORITHM_ERROR              = 0x07UL  /**< Algorithm error */
} cy_en_rram_verr_status_t;

/**
* RRAM AHB error codes
*/
typedef enum
{
    CY_RRAM_AHB_NO_ERROR                        = 0x00UL,  /**< No Error */
    CY_RRAM_OTP_TAGBIT_VIOLATION                = 0x01UL,  /**< OTP Tag bit violation during write */
    CY_RRAM_POSTREAD_CHK_TAGBIT_VIOLATION       = 0x02UL,  /**< Post-read check Tag bit violation during read */
    CY_RRAM_POSTREAD_CHK_ADDR_FAULT_ALRM        = 0x03UL,  /**< Post-read check address fault alarm */
    CY_RRAM_AHB_ERROR                           = 0x04UL,  /**< RARM IP AHB bus error */
    CY_RRAM_M0SEC_WRITE_ERROR                   = 0x05UL,  /**< Incomplete write or 8/16 write on the protected interface */
    CY_RRAM_WRITE_ADDR_MISMATCH                 = 0x06UL,  /**< Indirect sequence where AHB write address mismatch with SFR NVM_ADDR */
    CY_RRAM_PROTECTED_PRGM_ERROR                = 0x07UL,  /**< Programming PROTECTED_NVM lockable subsection */
    CY_RRAM_READ_UDS_WHILE_LOCKED               = 0x09UL,  /**< Detecting UDS read access while UDS is locked */
    CY_RRAM_UNLOCK_UDS_WHILE_LOCKED             = 0x0AUL,  /**< Detecting unlock UDS when it is locked */
    CY_RRAM_TAGBIT_GATING_CTL_ERROR             = 0x0BUL,  /**< Detecting Tag bit gating control error */
    CY_RRAM_OPRTN_ERR_WITHOUT_PC_ACQUISITION    = 0x0CUL,  /**< Executing indirect operation without a PC acquired */
    CY_RRAM_PC_MISMATCH_ERROR                   = 0x0DUL,  /**< Transaction PC is different than the acquired PC */
    CY_RRAM_EXECUTE_FORMING                     = 0x0EUL,  /**< Executing forming or looped forming in SORT LCS */
    CY_RRAM_PROTECTED_INTERFACE_MPC_VIOLATION   = 0x0FUL   /**< Protected interface MPC violation */
} cy_en_rram_hresp_t;


/**
* RRAM voltage/frequency mode for operations
*/
typedef enum
{
    CY_RRAM_VMODE_UNDEFINED  = 0x0UL,     /**<Undefined voltage/frequency mode for operations.*/
    CY_RRAM_VMODE_ULP        = 0x1UL,     /**<ULP voltage/frequency mode for operations.*/
    CY_RRAM_VMODE_LP         = 0x2UL,     /**<LP voltage/frequency mode for operations.*/
    CY_RRAM_VMODE_HP         = 0x3UL      /**<HP voltage/frequency mode for operations.*/
} cy_en_rram_vmode_t;

/**
* RRAM Junction Temperature
*/
typedef enum
{
    CY_RRAM_TEMP_INVALID               = 0x0UL,     /**< Invalid/Unknown junction temperature value.*/
    CY_RRAM_TEMP_LESS_THAN_EQ_50C      = 0x1UL,     /**< Tj <= 50C.*/
    CY_RRAM_TEMP_ABOVE_50C_BELOW_85C   = 0x2UL,     /**< 50C < Tj <= 85C.*/
    CY_RRAM_TEMP_ABOVE_85C_BELOW_100C  = 0x4UL,     /**< 85C < Tj <= 100C.*/
    CY_RRAM_TEMP_ABOVE_100C_BELOW_110C = 0x8UL,     /**< 100C < Tj <= 110C.*/
    CY_RRAM_TEMP_ABOVE_110C_BELOW_120C = 0xAUL,     /**< 110C < Tj <=120C.*/
    CY_RRAM_TEMP_ABOVE_120C            = 0xCUL,     /**< Tj > 120C.*/
} cy_en_rram_temperature_t;


/** \} group_rram_enums */

