PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_rram.h
/***************************************
*      Function Prototypes
***************************************/

/**
* \addtogroup group_rram_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_RRAM_OtpWriteByteArray
****************************************************************************//**
*
* \brief
* Writes array of byte data to the specified address.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the OTP subsection. The address should fall in General OTP or Protected OTP subsection.
*
* \param data
* Pointer to the data to be written to the specified address.
*
* \param numBytes
* Number of bytes to be written.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_OtpWriteByteArray
*
* \note
* OTP region is One Time Programmable. API does read-modify(OR)-write operation.
* Once the data bit has been programmed into the OTP region it can't be erased by writing a 0 to it.
* Any zero bit in the data indicates that write to this bit in OTP regions will be ignored.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes);


/*******************************************************************************
* Function Name: Cy_RRAM_OtpReadByteArray
****************************************************************************//**
*
* \brief
* Reads array of byte data from the specified address.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the OTP subsection. The address should fall in General OTP or Protected OTP subsection.
*
* \param data
* Pointer to the destination where the read data is stored.
*
* \param numBytes
* Number of bytes to be read.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_OtpReadByteArray
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes);


/*******************************************************************************
* Function Name: Cy_RRAM_OtpWriteWord
****************************************************************************//**
*
* \brief
* Writes a 32-bit word data to the specified address.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the OTP subsection. The address should fall in General OTP or Protected OTP subsection.
*
* \param data
* Data to be written to the specified address.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_OtpWriteWord
*
* \note
* OTP region is One Time Programmable. API does read-modify(OR)-write operation.
* Once the data bit has been programmed into the OTP region it can't be erased by writing a 0 to it.
* Any zero bit in the data indicates that write to this bit in OTP regions will be ignored.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpWriteWord(RRAMC_Type * base, uint32_t addr, uint32_t data);


/*******************************************************************************
* Function Name: Cy_RRAM_OtpReadWord
****************************************************************************//**
*
* \brief
* Reads a 32bit word data from the specified address.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the OTP subsection. The address should fall in General OTP or Protected OTP subsection.
*
* \param data
* Pointer to the destination where the read word is stored.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_OtpReadWord
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpReadWord(RRAMC_Type * base, uint32_t addr, uint32_t * data);


/*******************************************************************************
* Function Name: Cy_RRAM_OtpWriteBlock
****************************************************************************//**
*
* \brief
* Writes a block(16B) data to the specified address.
* Assumption is that the provided address is block aligned.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the OTP subsection. The address should fall in General OTP or Protected OTP subsection.
*
* \param data
* Pointer to the data to be written to the specified address.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_OtpWriteBlock
*
* \note OTP region is One Time Programmable. API does read-modify(OR)-write operation.
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpWriteBlock(RRAMC_Type * base, uint32_t addr, uint8_t *data);


/*******************************************************************************
* Function Name: Cy_RRAM_NvmWriteByteArray
****************************************************************************//**
*
* \brief
* Writes array of byte data to the specified address in blocking mode.
* API will wait for the write operation to be completed. It returns error or success status.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the NVM subsection. The address should fall in Main or Work or Sflash or Protected NVM subsection.
*
* \param data
* Pointer to the data to be written to the specified address.
*
* \param numBytes
* Number of bytes to be written.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_NvmWriteByteArray
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NvmWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes);


