PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_rram.h
/*******************************************************************************
* Function Name: Cy_RRAM_NvmReadByteArray
****************************************************************************//**
*
* \brief
* Reads array of byte data from the specified address.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the NVM subsection. The address should fall in Main or Work or Sflash or Protected NVM subsection.
*
* \param data
* Pointer to the destination where the read data is stored.
*
* \param numBytes
* Number of bytes to be read.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_NvmReadByteArray
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NvmReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes);


/*******************************************************************************
* Function Name: Cy_RRAM_NonBlockingNvmWriteByteArray
****************************************************************************//**
*
* \brief
* Writes array of byte data to the specified address in Non Blocking mode.
* API will only validate parameter and performs write operation. User needs to call \ref Cy_RRAM_GetStatus() to
* check the status of write operation.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the NVM subsection. The address should fall in Main or Work or Sflash or Protected NVM subsection.
*
* \param data
* Pointer to the data to be written to the specified address.
*
* \param numBytes
* Number of bytes to be written.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_NonBlockingNvmWriteByteArray
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NonBlockingNvmWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes);


/*******************************************************************************
* Function Name: Cy_RRAM_NvmWriteBlock
****************************************************************************//**
*
* \brief
* Writes a block(16B) data to the specified address.
* Assumption is that the provided address is Block aligned.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of the NVM subsection. The address should fall in Main or Work or Sflash or Protected NVM subsection.
*
* \param data
* Pointer to the data to be written to the specified address.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_NvmWriteBlock
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NvmWriteBlock(RRAMC_Type * base, uint32_t addr, uint8_t *data);


/*******************************************************************************
* Function Name: Cy_RRAM_WriteByteArray
****************************************************************************//**
*
* \brief
* Writes array of byte data to the specified address in blocking mode.
* API will wait for the write operation to be completed. It returns error or success status.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of RRAM memory. The provided address should fall under one of the NVM or OTP sub
* sections otherwise bad parameter error will be returned.
*
* \param data
* Pointer to the data to be written to the specified address.
*
* \param numBytes
* Number of bytes to be written.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_WriteByteArray
*
* \note OTP region is One Time Programmable. API does read-modify(OR)-write operation.
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_WriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes);


/*******************************************************************************
* Function Name: Cy_RRAM_TSWriteByteArray
****************************************************************************//**
*
* \brief
* Writes an array of byte data to the specified address in blocking mode without considering
* uncorrectable ECC fail error.
* API will wait for the write operation to be completed. It returns error or success status.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of RRAM memory. The provided address should fall under one of the NVM or OTP sub
* sections otherwise bad parameter error will be returned.
*
* \param data
* Pointer to the data to be written to the specified address.
*
* \param numBytes
* Number of bytes to be written.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_TSWriteByteArray
*
* \note
* This API should be used only for tearing safe use cases.
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_TSWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes);


/*******************************************************************************
* Function Name: Cy_RRAM_ReadByteArray
****************************************************************************//**
*
* \brief
* Reads an array of byte data from the specified address.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of RRAM memory. The provided address should fall under one of the NVM or OTP sub
* sections otherwise bad parameter error will be returned.
*
* \param data
* Pointer to the destination where the read data is stored.
*
* \param numBytes
* Number of bytes to be read.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_ReadByteArray
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_ReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes);


