PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_rram.h
/*******************************************************************************
* Function Name: Cy_RRAM_TSReadByteArray
****************************************************************************//**
*
* \brief
* Reads an array of byte data from the specified address after validating the
* uncorrectable ECC fail bits.
* Returns ECC fail error if uncorrectable ECC fail error exist.
* This function tries to acquire the lock. If the
* lock is not available, then it returns immediately with
* CY_RRAM_ACQUIRE_PC_LOCK_FAIL error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param addr
* Address of RRAM memory. The provided address should fall under one of the NVM or OTP sub
* sections otherwise bad parameter error will be returned.
*
* \param data
* Pointer to the destination where the read data is stored.
*
* \param numBytes
* Number of bytes to be read.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_ReadByteArray
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_TSReadByteArray
*
* \note
* This API should be used only for tearing safe use cases.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_TSReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes);


#if (CY_CPU_CORTEX_M0P)
/*******************************************************************************
* Function Name : Cy_RRAM_Init
****************************************************************************//**
*
* \brief
* Retrieves configuration settings from configuration space in extra area.
*
* Sequence followed:
* Set voltage/frequency mode \ref cy_en_rram_vmode_t
* Start "Retrieve configuration settings" sequence and waits until
* the sequence finishes.
* Validate for read errors and return status.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param vmode
* voltage/frequency mode for operations.
*
* \param retrvAlgoInfo
* Set the parameter to true in order to retrieve the write algorithm information along
* with the SYSCONF information and configuration settings.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \note
* This API is available only for CM0P
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_Init(RRAMC_Type * base, cy_en_rram_vmode_t vmode, bool retrvAlgoInfo);
#endif


/*******************************************************************************
* Function Name: Cy_RRAM_GetStatus
****************************************************************************//**
*
* \brief
* Get the status of RRAM. It includes information about busy status, sleep status,
* status on ECC during read operation, write protection error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* RRAM status.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_NonBlockingNvmWriteByteArray
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_RRAM_GetStatus(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    return RRAM_NVM_STATUS(base);
}


/*******************************************************************************
* Function Name: Cy_RRAM_IsBusy
****************************************************************************//**
*
* Indicates the status of NVM Busy flag.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* RRAM status:  true - Busy, false - Not busy.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_RRAM_IsBusy(RRAMC_Type * base)
{
    return (bool)_FLD2VAL(RRAMC_RRAM_SFR_NVM_STATUS_BUSY, RRAM_NVM_STATUS(base));
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetAHBError
****************************************************************************//**
*
* \brief
* Gets AHB bus error occurred during transactions.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* Status. Refer \ref cy_en_rram_hresp_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_NonBlockingNvmWriteByteArray
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_hresp_t Cy_RRAM_GetAHBError(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    return (cy_en_rram_hresp_t)_FLD2VAL(RRAMC_RRAMC_AHB_HRESP_HRESP, RRAM_AHB_HRESP(base));
}


/*******************************************************************************
* Function Name: Cy_RRAM_EnableSleepMode
****************************************************************************//**
*
* \brief
* Puts RRAM in Sleep mode. No memory access is possible in NVM sleep mode.
* During sleep, the SFR NVM_CONF1 can be read and written, all other SFRs are read-only.
*
* \param base
* The pointer to the RRAMC instance.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_Sleep
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_EnableSleepMode(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    RRAM_NVM_CONF1(base) &= ~RRAMC_RRAM_SFR_NVM_CONF1_NVM_ON_Msk;
}


/*******************************************************************************
* Function Name: Cy_RRAM_DisableSleepMode
****************************************************************************//**
*
* \brief
* Puts RRAM in Normal mode.
*
* \param base
* The pointer to the RRAMC instance.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_Sleep
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_DisableSleepMode(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    RRAM_NVM_CONF1(base) |= RRAMC_RRAM_SFR_NVM_CONF1_NVM_ON_Msk;
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetSleepStatus
****************************************************************************//**
*
* \brief
* Gets the sleep status of RRAM.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* Status. Refer \ref cy_en_rram_sleep_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_Sleep
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_sleep_t Cy_RRAM_GetSleepStatus(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    return (cy_en_rram_sleep_t)_FLD2VAL(RRAMC_RRAM_SFR_NVM_STATUS_SLEEP, RRAM_NVM_STATUS(base));
}


