PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_rram.h
/*******************************************************************************
* Function Name: Cy_RRAM_EnableWP
****************************************************************************//**
*
* \brief
* Enables write protection for number of sectors starting with sector 0 in RRAM NVM region.
* Before calling this API, user need to call Cy_RRAM_GetWPLockState() API and
* make sure the write protection lock is not locked. Otherwise this API will return
* CY_RRAM_WPLOCK_ENABLED error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param numSectors
* Number of sectors.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_WriteProtection
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_EnableWP(RRAMC_Type * base, uint32_t numSectors);


/*******************************************************************************
* Function Name: Cy_RRAM_DisableWP
****************************************************************************//**
*
* \brief
* Disables write protection for all sectors in RRAM NVM region.
* Before calling this API, user need to call Cy_RRAM_GetWPLockState() API and
* make sure the write protection lock is not locked. Otherwise this API will return
* CY_RRAM_WPLOCK_ENABLED error.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_WriteProtection
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_DisableWP(RRAMC_Type * base);


/*******************************************************************************
* Function Name: Cy_RRAM_SetWPLock
****************************************************************************//**
*
* \brief
* Enables the write protection lock by setting WPCLK to 1.
* Once locked, the lock state cannot be changed till next reset.
*
* \param base
* The pointer to the RRAMC instance.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_WriteProtection
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_SetWPLock(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    /* Enable write protection lock by setting WPCLK to 1 */
    RRAM_NVM_CONF1(base) |= RRAMC_RRAM_SFR_NVM_CONF1_WPLCK_Msk;
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetWPLockState
****************************************************************************//**
*
* \brief
* Gets the state of write protection lock.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* Status. Refer \ref cy_en_rram_wp_lock_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_WriteProtection
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_wp_lock_t Cy_RRAM_GetWPLockState(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    return (cy_en_rram_wp_lock_t)_FLD2VAL(RRAMC_RRAM_SFR_NVM_CONF1_WPLCK, RRAM_NVM_CONF1(base));
}


/*******************************************************************************
* Function Name: Cy_RRAM_SetVoltageMode
****************************************************************************//**
*
* \brief
* Set voltage/frequency mode.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param vmode
* Voltage mode. Refer \ref cy_en_rram_vmode_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_UpdateVoltageMode
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_SetVoltageMode(RRAMC_Type * base, cy_en_rram_vmode_t vmode)
{
    CY_ASSERT_L1(NULL != base);

    /* Sets voltage/frequency mode */
    uint32_t temp = RRAM_NVM_VMODE(base) & ~ RRAMC_RRAM_SFR_NVM_VMODE_VMODE_Msk;
    RRAM_NVM_VMODE(base) = temp | _VAL2FLD(RRAMC_RRAM_SFR_NVM_VMODE_VMODE, vmode);
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetVoltageMode
****************************************************************************//**
*
* \brief
* Get voltage/frequency mode.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* Voltage mode. Refer \ref cy_en_rram_vmode_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_UpdateVoltageMode
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_vmode_t Cy_RRAM_GetVoltageMode(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    /* Get voltage/frequency mode */
    return (cy_en_rram_vmode_t)_FLD2VAL(RRAMC_RRAM_SFR_NVM_VMODE_VMODE, RRAM_NVM_VMODE(base));
}

/*******************************************************************************
* Function Name: Cy_RRAM_SetTemperature
****************************************************************************//**
*
* \brief
* Set junction temperature.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param temperature
* Temperature. Refer \ref cy_en_rram_temperature_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetTemperature
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_SetTemperature(RRAMC_Type * base, cy_en_rram_temperature_t temperature)
{
    CY_ASSERT_L1(NULL != base);

    /* Sets junction temperature */
    uint32_t temp = RRAM_NVM_PROG(base) & ~ RRAMC_RRAM_SFR_NVM_PROG_TEMP_Msk;
    RRAM_NVM_PROG(base) = temp | _VAL2FLD(RRAMC_RRAM_SFR_NVM_PROG_TEMP, temperature);
}

/*******************************************************************************
* Function Name: Cy_RRAM_GetTemperature
****************************************************************************//**
*
* \brief
* Get junction temperature.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* Temperature. Refer \ref cy_en_rram_temperature_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetTemperature
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_temperature_t Cy_RRAM_GetTemperature(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    /* Get junction temperature */
    return (cy_en_rram_temperature_t)_FLD2VAL(RRAMC_RRAM_SFR_NVM_PROG_TEMP, RRAM_NVM_PROG(base));
}

