PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_rram.h
/*******************************************************************************
* Function Name: Cy_RRAM_SetProtLockableRegion
****************************************************************************//**
*
* \brief
* Sets the size of lockable region in PROTECTED_NVM region. If size is larger than
* PROTECTERD_NVM, the entire PROTECTED_NVM is lockable. The lockable region can be configured
* only if the protected nvm lock state is unlocked. The configured region is protected only when the
* protected nvm lock state is locked
*
* \param base
* The pointer to the RRAMC instance.
*
* \param regionSize
* Size of lockable region in KB. The valid range is 1-256.
*
* \return
* Status. Refer \ref cy_en_rram_status_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetProtLockableRegion
*
* \note
* This API is available for only CM0 secure enclave.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_SetProtLockableRegion(RRAMC_Type * base, uint32_t regionSize);


/*******************************************************************************
* Function Name: Cy_RRAM_GetProtLockableRegion
****************************************************************************//**
*
* \brief
* Gets the size of configured lockable region in PROTECTED_NVM region.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* Size of lockable region in KB.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetProtLockableRegion
*
* \note
* This API is available for only CM0 secure enclave.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_RRAM_GetProtLockableRegion(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    return _FLD2VAL(RRAMC_RRAMC_PROTECTED_LOCKABLE_LOCK_PARTITION_SIZE_0, RRAM_PROTECTED_LOCKABLE_LOCK(base));
}


/*******************************************************************************
* Function Name: Cy_RRAM_SetProtLock
****************************************************************************//**
*
* \brief
* Enables the lock for the configured PROTECTED_NVM region \ref Cy_RRAM_SetProtLockableRegion().
* Updating the configured region and lockable programming are NOT allowed. The topmost
* 1KB of lockable region which is always writable regardless of lock status.
* Once locked, the lock state cannot be changed till next reset.
*
* \param base
* The pointer to the RRAMC instance.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetProtLockableRegion
*
* \note
* This API is available for only CM0 secure enclave.
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_SetProtLock(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    RRAM_PROTECTED_LOCKABLE_LOCK(base) |= RRAMC_RRAMC_PROTECTED_LOCKABLE_LOCK_LOCK_Msk;
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetProtLockState
****************************************************************************//**
*
* \brief
* Get the lock state of the PROTECTED_NVM Lockable region.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return
* State. \ref cy_en_rram_protected_lock_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetProtLockableRegion
*
* \note
* This API is available for only CM0 secure enclave.
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_protected_lock_t Cy_RRAM_GetProtLockState(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    return (cy_en_rram_protected_lock_t)_FLD2VAL(RRAMC_RRAMC_PROTECTED_LOCKABLE_LOCK_LOCK, RRAM_PROTECTED_LOCKABLE_LOCK(base));
}


/*******************************************************************************
* Function Name: Cy_RRAM_SetUDSLock
****************************************************************************//**
*
* \brief
* Enables the lock to avoid access to UDS key.
* Once locked, the lock state cannot be changed till next reset.
*
* \param base
* The pointer to the RRAMC instance.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetUDSLock
*
* \note
* This API is available for only CM0 secure enclave.
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_SetUDSLock(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    RRAM_UDS_CTL(base) |= RRAMC_RRAMC_UDS_CTL_LOCK_Msk;
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetUDSLockState
****************************************************************************//**
*
* \brief
* Get the status of UDS lock. If it is locked then there will be no access to UDS key.
* Until the lock is unlocked. The lock state cannot be changed till next reset.
*
* \param base
* The pointer to the RRAMC instance.
*
* \return lockState
* State of the lock. Refer \ref cy_en_rram_uds_lock_t
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetUDSLock
*
* \note
* This API is available for only CM0 secure enclave.
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_uds_lock_t Cy_RRAM_GetUDSLockState(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    return (cy_en_rram_uds_lock_t)_FLD2VAL(RRAMC_RRAMC_UDS_CTL_LOCK, RRAM_UDS_CTL(base));
}


/*******************************************************************************
* Function Name: Cy_RRAM_SetUDSConfig
****************************************************************************//**
*
* \brief
* Configure UDS to trigger a AHB error or read as zero without error when there is a read
* access to UDS. It is effective only when UDS is locked.
*
* \param base
* The pointer to the RRAMC instance.
*
* \param config
* Set to true to trigger AHB error when there is a read access to UDS.
* Set to false to return read as zero for the read access without any AHB error.
*
* \funcusage
* \snippet rram/snippet/main.c snippet_Cy_RRAM_SetUDSLock
*
* \note
* This API is available for only CM0 secure enclave.
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_SetUDSConfig(RRAMC_Type * base, bool config)
{
    CY_ASSERT_L1(NULL != base);

    if (config)
    {
        RRAM_UDS_CTL(base) |= RRAMC_RRAMC_UDS_CTL_CONFIG_Msk;
    }
    else
    {
        RRAM_UDS_CTL(base) &= ~RRAMC_RRAMC_UDS_CTL_CONFIG_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_RRAM_ForceRelPCLock
****************************************************************************//**
*
* Release PC lock forcefully. In order to avoid deadlock situation during indirect
* write operation, CM0 has the capability to release or break the acquired lock.
* Should be called only when a pc lock acquired by CM33/CM55 during indirect write
* operation needs be released forcefully.
* This API can be called before the start of write operation from CM0.
* This API is only available for CM0 secure enclave.
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_ForceRelPCLock(RRAMC_Type * base)
{
    CY_ASSERT_L1(NULL != base);

    RRAM_PC_MASK(base) &= ~RRAMC_RRAMC_PC_MASK_PC_LOCK_Msk;
}


/** \} group_rram_functions */

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22RRAMC */

#endif /* CY_rram_H */

/** \} group_rram */

/* [] END OF FILE */
